# Terraform plan for staging

```
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=stg-piny940/iamcredentials.googleapis.com]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/stg-piny940/serviceAccounts/clubroom@stg-piny940.iam.gserviceaccount.com]
module.velero.google_service_account.velero: Refreshing state... [id=projects/stg-piny940/serviceAccounts/velero@stg-piny940.iam.gserviceaccount.com]
module.velero.google_storage_bucket.velero: Refreshing state... [id=stg-velero-cluster-backup.piny940.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.kube_workload_identity.google_secret_manager_secret.home_kubernetes_cluster_jwks: Refreshing state... [id=projects/stg-piny940/secrets/home-kubernetes-cluster-jwks]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.velero.google_project_iam_member.velero_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/serviceAccount:velero@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/serviceAccount:clubroom@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=stg-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=stg-piny940/roles/owner/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=stg-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Reading...
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/clubroom@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom]
module.terraform.google_iam_workload_identity_pool_provider.repo_github_actions: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/repo-github-actions]
module.terraform.google_service_account_iam_member.terraform_github_actions_main_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:ref:refs/heads/main]
module.terraform.google_service_account_iam_member.terraform_github_actions_pull_request_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:pull_request]
module.terraform.google_service_account_iam_member.terraform_github_actions_env_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:staging]
module.kube_workload_identity.data.google_secret_manager_secret_version.home_kubernetes_cluster_jwks: Read complete after 0s [id=projects/645068243364/secrets/home-kubernetes-cluster-jwks/versions/4]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_service.default["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "default" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "stg-piny940"
      + service            = "cloudbilling.googleapis.com"
    }

  # google_project_service.default["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "default" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "stg-piny940"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.default["firebase.googleapis.com"] will be created
  + resource "google_project_service" "default" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "stg-piny940"
      + service            = "firebase.googleapis.com"
    }

  # google_project_service.default["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "default" {
      + disable_on_destroy = true
      + id                 = (known after apply)
      + project            = "stg-piny940"
      + service            = "serviceusage.googleapis.com"
    }

  # module.auth.google_firebase_project.auth will be created
  + resource "google_firebase_project" "auth" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "stg-piny940"
      + project_number = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentGCP Plan for staging -->